#print(5, 8 ,6 )

#n = None
#print(n)

# n = 1.89

# print(n)
# n = 'qwer'
# print(n)
n= 5

print(type(n))

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
# n = int(input("Введите число n, больше 0 "))
# my_list = []
# factorial = 1
# for i in range(1, n + 1):
#     factorial *= i
#     my_list.append(factorial)
# print(my_list)

# Даны две строки. Посчитайте сколько раз каждый символ первой строки встречается во второй
# «one» «onetwonine» - o – 2, n – 3, e – 2

# template = "one"
# initial_string = "onetwonine"

# for i in template:
#     x = initial_string.count(i)
#     print(f"{i} встречается в строке {initial_string} {x} раз")

